{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4, 8, 8], "name": "inputs_board", "sparse": false}, "inbound_nodes": [], "name": "inputs_board"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "initial_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["inputs_board", 0, 0, {}]]], "name": "initial_conv2d"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "initial_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["initial_conv2d", 0, 0, {}]]], "name": "initial_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "initial_act"}, "inbound_nodes": [[["initial_bn", 0, 0, {}]]], "name": "initial_act"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["initial_act", 0, 0, {}]]], "name": "ResLayer_0_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_conv0", 0, 0, {}]]], "name": "ResLayer_0_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act0"}, "inbound_nodes": [[["ResLayer_0_bn0", 0, 0, {}]]], "name": "ResLayer_0_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act0", 0, 0, {}]]], "name": "ResLayer_0_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_conv1", 0, 0, {}]]], "name": "ResLayer_0_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_0_add"}, "inbound_nodes": [[["initial_act", 0, 0, {}], ["ResLayer_0_bn1", 0, 0, {}]]], "name": "ResLayer_0_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act_after"}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}]]], "name": "ResLayer_0_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act_after", 0, 0, {}]]], "name": "ResLayer_1_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_conv0", 0, 0, {}]]], "name": "ResLayer_1_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act0"}, "inbound_nodes": [[["ResLayer_1_bn0", 0, 0, {}]]], "name": "ResLayer_1_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act0", 0, 0, {}]]], "name": "ResLayer_1_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_conv1", 0, 0, {}]]], "name": "ResLayer_1_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_1_add"}, "inbound_nodes": [[["ResLayer_0_act_after", 0, 0, {}], ["ResLayer_1_bn1", 0, 0, {}]]], "name": "ResLayer_1_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act_after"}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}]]], "name": "ResLayer_1_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act_after", 0, 0, {}]]], "name": "ResLayer_2_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_conv0", 0, 0, {}]]], "name": "ResLayer_2_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act0"}, "inbound_nodes": [[["ResLayer_2_bn0", 0, 0, {}]]], "name": "ResLayer_2_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act0", 0, 0, {}]]], "name": "ResLayer_2_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_conv1", 0, 0, {}]]], "name": "ResLayer_2_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_2_add"}, "inbound_nodes": [[["ResLayer_1_act_after", 0, 0, {}], ["ResLayer_2_bn1", 0, 0, {}]]], "name": "ResLayer_2_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act_after"}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}]]], "name": "ResLayer_2_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act_after", 0, 0, {}]]], "name": "ResLayer_3_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_conv0", 0, 0, {}]]], "name": "ResLayer_3_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act0"}, "inbound_nodes": [[["ResLayer_3_bn0", 0, 0, {}]]], "name": "ResLayer_3_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act0", 0, 0, {}]]], "name": "ResLayer_3_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_conv1", 0, 0, {}]]], "name": "ResLayer_3_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_3_add"}, "inbound_nodes": [[["ResLayer_2_act_after", 0, 0, {}], ["ResLayer_3_bn1", 0, 0, {}]]], "name": "ResLayer_3_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act_after"}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}]]], "name": "ResLayer_3_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act_after", 0, 0, {}]]], "name": "ResLayer_4_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_conv0", 0, 0, {}]]], "name": "ResLayer_4_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act0"}, "inbound_nodes": [[["ResLayer_4_bn0", 0, 0, {}]]], "name": "ResLayer_4_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act0", 0, 0, {}]]], "name": "ResLayer_4_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_conv1", 0, 0, {}]]], "name": "ResLayer_4_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_4_add"}, "inbound_nodes": [[["ResLayer_3_act_after", 0, 0, {}], ["ResLayer_4_bn1", 0, 0, {}]]], "name": "ResLayer_4_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act_after"}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}]]], "name": "ResLayer_4_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act_after", 0, 0, {}]]], "name": "ResLayer_5_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv0", 0, 0, {}]]], "name": "ResLayer_5_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act0"}, "inbound_nodes": [[["ResLayer_5_bn0", 0, 0, {}]]], "name": "ResLayer_5_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act0", 0, 0, {}]]], "name": "ResLayer_5_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv1", 0, 0, {}]]], "name": "ResLayer_5_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_5_add"}, "inbound_nodes": [[["ResLayer_4_act_after", 0, 0, {}], ["ResLayer_5_bn1", 0, 0, {}]]], "name": "ResLayer_5_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act_after"}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}]]], "name": "ResLayer_5_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act_after", 0, 0, {}]]], "name": "ResLayer_6_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv0", 0, 0, {}]]], "name": "ResLayer_6_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act0"}, "inbound_nodes": [[["ResLayer_6_bn0", 0, 0, {}]]], "name": "ResLayer_6_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act0", 0, 0, {}]]], "name": "ResLayer_6_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv1", 0, 0, {}]]], "name": "ResLayer_6_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_6_add"}, "inbound_nodes": [[["ResLayer_5_act_after", 0, 0, {}], ["ResLayer_6_bn1", 0, 0, {}]]], "name": "ResLayer_6_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act_after"}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}]]], "name": "ResLayer_6_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act_after", 0, 0, {}]]], "name": "ResLayer_7_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv0", 0, 0, {}]]], "name": "ResLayer_7_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act0"}, "inbound_nodes": [[["ResLayer_7_bn0", 0, 0, {}]]], "name": "ResLayer_7_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act0", 0, 0, {}]]], "name": "ResLayer_7_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv1", 0, 0, {}]]], "name": "ResLayer_7_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_7_add"}, "inbound_nodes": [[["ResLayer_6_act_after", 0, 0, {}], ["ResLayer_7_bn1", 0, 0, {}]]], "name": "ResLayer_7_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act_after"}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}]]], "name": "ResLayer_7_act_after"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "to_flatten_value_head_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ResLayer_7_act_after", 0, 0, {}]]], "name": "to_flatten_value_head_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "to_flatten_policy_head_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ResLayer_7_act_after", 0, 0, {}]]], "name": "to_flatten_policy_head_conv2d"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "to_flatten_value_head_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["to_flatten_value_head_conv2d", 0, 0, {}]]], "name": "to_flatten_value_head_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "to_flatten_policy_head_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["to_flatten_policy_head_conv2d", 0, 0, {}]]], "name": "to_flatten_policy_head_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "to_flatten_value_head_act"}, "inbound_nodes": [[["to_flatten_value_head_bn", 0, 0, {}]]], "name": "to_flatten_value_head_act"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "to_flatten_policy_head_act"}, "inbound_nodes": [[["to_flatten_policy_head_bn", 0, 0, {}]]], "name": "to_flatten_policy_head_act"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["to_flatten_value_head_act", 0, 0, {}]]], "name": "flatten_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["to_flatten_policy_head_act", 0, 0, {}]]], "name": "flatten_3"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Dropout", "config": {"rate": 0.333, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value_hidden_layer", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "value_hidden_layer"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "policy", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 310, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "policy"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["value_hidden_layer", 0, 0, {}]]], "name": "value"}], "input_layers": [["inputs_board", 0, 0]], "output_layers": [["policy", 0, 0], ["value", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}